import React, { useEffect } from 'react'

export default function help() {
    useEffect(() => {
        window.scrollTo(0, 0);
      }, []);
    return (
        <div>
          <h1>قد تصادفك عزيزتي الطالبه بعض المصطلحات و المفاهيم اثناء ابحارك داخل بيئتنا التكيفيه</h1>
          <ul>
              <li>مفهوم بيئه التعلم التكيفيه</li>
              <p> هي بيئه تعتمد علي تعدديه و تنويع عرض المحتوي و تطويعها وفقا لاساليب التعلم الخاصه بكل متعلم وقيقدم المحتوي و كانه موجه لكل طالب علي حده و بحيث يتم تقديم مجموعه متنوعه من الانشطه التكيفيه تكون مراعسه لاختلاف انماط المتعلمين و مناسبه لقدراتهم الذهنيه</p>
              <li> مفهوم الابحار  </li>
              <p> هو التنقل و غالبا ما يحدث ف نفس الصفحه الموقع او بصفحات الموقع المختلفه</p>
              <li>مفهوم  اساليب التعلم</li>
              <p> هي مجموعه من السلوكيات المعرفيه و الوجدانيه و النفسيه , و التي تعمل كمؤشرات نسبيا لكيفيه ادراك و تفاعل و استجابه الطالب مع بيئه التعلم </p>
              <li>  مفهوم الروابط </li>
              <p>  ... المعروفه ايضا باسم الوصلات الوارده , هي وصات ذات كلمه معينه الي موقع او صفحه علي الانترنت , كلما كان الترتيب و اهميه الموقه عاليه طلما حظي الموقع ف الرابط النصي بتقييم اعلي لدي محركات البحث , و التي تعد من احدي عناصر (تحسين محركات البحث ) التي تساهم في رفع ترتيب الموقع و يمكن ان يكون الرابط صوره او صوت او فيديو </p>
              </ul>
        </div>
    )
}
